# <font color="purple"><h3 align="center">Different Ways Of Creating Dataframe</h3></font>

# Read CSV File and Create DataFrame Object

In [1]:
import pandas as pd
#Read CSV File and Create DataFrame Object
df=pd.read_csv('nyc_weather.csv')
df.head(2)

,EST,Temperature,DewPoint,Humidity,Sea_Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275

# Read Excel File and Create DataFrame Object

In [2]:
import pandas as pd
#Read Excel File and Create DataFrame Object
df2=pd.read_excel('weather_data-Copy1.xls',sheet_name='weather_data')
df2.head(2)

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-04          NaN        7.0  Sunny

In [3]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
day            9 non-null datetime64[ns]
temperature    6 non-null float64
windspeed      6 non-null float64
event          7 non-null object
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 368.0+ bytes

# Using dictionary

In [4]:
import pandas as pd
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'windspeed': [6,7,2],
    'event': ['Rain', 'Sunny', 'Snow']
}

weather_data

{'day': ['1/1/2017', '1/2/2017', '1/3/2017'],
 'temperature': [32, 35, 28],
 'windspeed': [6, 7, 2],
 'event': ['Rain', 'Sunny', 'Snow']}

In [6]:
df=pd.DataFrame(data=weather_data,columns=['event','windspeed','day','Temp'])
df

   event  windspeed       day Temp
0   Rain          6  1/1/2017  NaN
1  Sunny          7  1/2/2017  NaN
2   Snow          2  1/3/2017  NaN

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
event        3 non-null object
windspeed    3 non-null int64
day          3 non-null object
Temp         0 non-null object
dtypes: int64(1), object(3)
memory usage: 176.0+ bytes

## <font color="green">Using tuples list</h3></font>

In [8]:
import pandas as pd
weather_data = [
    ('1/1/2017',32,6,'Fog'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]
weather_data

[('1/1/2017', 32, 6, 'Fog'),
 ('1/2/2017', 35, 7, 'Sunny'),
 ('1/3/2017', 28, 2, 'Snow')]

In [10]:
df=pd.DataFrame(data=weather_data,columns=['EST','Temp','Windspeed','Events'])
df

        EST  Temp  Windspeed Events
0  1/1/2017    32          6    Fog
1  1/2/2017    35          7  Sunny
2  1/3/2017    28          2   Snow

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
EST          3 non-null object
Temp         3 non-null int64
Windspeed    3 non-null int64
Events       3 non-null object
dtypes: int64(2), object(2)
memory usage: 176.0+ bytes

# Export DataFrame Object Into Files ?

In [14]:
df.to_csv('new.csv',index=False)

In [15]:
df.to_excel('new1.xlsx',sheet_name='data',index=False)

# DBToExcel ?

In [16]:
import psycopg2
import pandas as pd
import sys
# Connection parameters, yours will be different
param_dic = {
    "host"      : "localhost",
    "database"  : "learning",
    "user"      : "nishant",
    "password"  : "1234"
}
def connect(params_dic):
    """ Connect to the PostgreSQL database server """
    conn = None
    try:
        # connect to the PostgreSQL server
        print('Connecting to the PostgreSQL database...')
        conn = psycopg2.connect(**params_dic)
    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
        sys.exit(1) 
    print("Connection successful")
    return conn


def postgresql_to_dataframe(conn, select_query):
    """
    Tranform a SELECT query into a pandas dataframe
    """
    cursor = conn.cursor()
    try:
        cursor.execute(select_query)
    except (Exception, psycopg2.DatabaseError) as error:
        print("Error: %s" % error)
        cursor.close()
        return 1

    # Naturally we get a list of tupples
    tupples = cursor.fetchall()
    column_names=[desc[0] for desc in cursor.description]
    conn.close()

    # We just need to turn it into a pandas dataframe
    df = pd.DataFrame(tupples, columns=column_names)
    return df

In [18]:
conn=connect(param_dic)
sql="Select * from amd01"
df=postgresql_to_dataframe(conn, sql)
df

Connecting to the PostgreSQL database...
Connection successful

       id     name  age           address     salary
0       2      Raj   45           test 02     56.900
1       4      Raj   45              None     67.890
2       5      Raj   45                       67.890
3       6      Raj   45              None        NaN
4      11   Dongli   54        florida us  34556.800
5      12    Mr.Wu   38  near lake,Boston     34.908
6      14   Rajesh   98              None     45.798
7      15     Jhon   94              None        NaN
8     121    Mr.Wu   38  near lake,Boston     34.908
9     141   Rajesh   98              None     45.798
10    151     Jhon   94              None        NaN
11   1111   Dongli   54        florida us  34556.800
12   1211    Mr.Wu   38  near lake,Boston     34.908
13   1411   Rajesh   98              None     45.798
14   1511     Jhon   94              None        NaN
15  15111     Jhon   94              None        NaN
16    901     Jhon   94              None        NaN
17    189  Nishant   45              None        NaN
18     13  Nishant   45              None        NaN
19   1891  Nishant   45              None        NaN
20    131  Nishant   45              None        NaN
21  18911  Nishant   45              None        NaN
22   1311  Nishant   45              None        NaN

In [19]:
df.to_excel('dbToexcel.xlsx',sheet_name='DB2Excel',index=False)

# ExcelToDB ?

In [ ]:
########################################